import React from 'react';
import Container from 'react-bootstrap/Container';

export default function ParentsPage(): JSX.Element {
  return (
    <Container
      style={{
        minWidth: '700px',
        margin: '0 auto',
        maxWidth: '1056px',
        paddingTop: '24px',
      }}
    >
      <h1
        style={{
          fontSize: '48px',
        }}
      >
        Представляем Elbrus Kids – платформу для обучения программированию подростков
      </h1>
      <p
        style={{
          margin: '0 0 18px',
          color: 'rgb(100, 200, 300)',
        }}
      >
        В мире, где технологии играют все более важную роль, навыки программирования становятся всё
        более ценными и востребованными. Как родитель, вы хотите предоставить своему ребенку лучшие
        возможности для успешного развития в эпоху цифровых технологий. Представляем Elbrus Kids –
        инновационную онлайн-платформу, которая поможет подросткам изучить программирование с
        удовольствием и интересом. В этой статье мы расскажем, как Elbrus Kids может помочь вашему
        ребенку овладеть программированием, о преимуществах такого изучения и предложим полезные
        советы о том, как помочь ребенку эффективно распределить время на учебу.
      </p>
      <h2
        style={{
          color: 'black',
          fontSize: '24px',
          lineHeight: '26px',
          margin: '0 0 25px',
        }}
      >
        Помощь подросткам в изучении программирования
      </h2>
      <p>
        Elbrus Kids – это комплексная образовательная платформа, которая объединяет обучающие видео,
        интерактивные упражнения по программированию и функции отслеживания прогресса, чтобы создать
        увлекательный процесс обучения. Вот как Elbrus Kids может помочь вашему ребенку на пути к
        овладению программированием:
      </p>
      <h2
        style={{
          color: 'black',
          fontSize: '24px',
          lineHeight: '26px',
          margin: '0 0 25px',
        }}
      >
        Интерактивные образовательные материалы
      </h2>
      <p>
        Elbrus Kids предлагает обширную библиотеку образовательных видео, специально разработанных
        для подростков. Видео охватывают широкий спектр программных концепций – от основ
        программирования до более сложных тем, таких как веб-разработка. Каждое видео создано таким
        образом, чтобы быть увлекательным и понятным, обеспечивая мотивацию ребенка на протяжении
        всего процесса обучения.
      </p>
      <h2
        style={{
          color: 'black',
          fontSize: '24px',
          lineHeight: '26px',
          margin: '0 0 25px',
        }}
      >
        Практические упражнения по программированию
      </h2>
      <p>
        Изучение программирования – это не только теория, но и практическое применение. Elbrus Kids
        предлагает интерактивные упражнения по программированию, которые позволяют вашему ребенку
        практиковаться и применять полученные знания. Эти упражнения предлагают практический подход
        к обучению, закрепляют концепции и развивают навыки решения задач.
      </p>
      <h2
        style={{
          color: 'black',
          fontSize: '24px',
          lineHeight: '26px',
          margin: '0 0 25px',
        }}
      >
        Отслеживание прогресса
      </h2>
      <p>
        Elbrus Kids понимает важность отслеживание прогресса для поддержания мотивации у студентов.
        Платформа предлагает систему комплексного отслеживания прогресса, которая позволяет вашему
        ребенку контролировать свой путь обучения. Они могут отслеживать завершенные видеоуроки,
        выполненные упражнения по программированию, а также получать значки и награды за свои
        достижения. Такой игровой подход помогает формировать чувство достижения и стимулирует
        постоянное обучение.
      </p>
      <h2
        style={{
          color: 'black',
          fontSize: '24px',
          lineHeight: '26px',
          margin: '0 0 25px',
        }}
      >
        Изучение программирования с использованием Elbrus Kids предлагает множество преимуществ для
        вашего ребенка:
      </h2>
      <p>
        Будущие навыки: В современном цифровом мире навыки программирования являются востребованными
        во многих отраслях. Изучение программирования в юном возрасте дает вашему ребенку ценный
        набор навыков, открывающих двери к увлекательным карьерным возможностям в будущем.
      </p>
      <p>
        Критическое мышление и навыки решения проблем: Программирование требует логического мышления
        и умения решать проблемы. Благодаря выполнению упражнений и
      </p>
    </Container>
  );
}
